## test plan
```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_s3_bucket.this_bucket has been deleted
-   resource "aws_s3_bucket" "this_bucket" {
-       arn                         = "arn:aws:s3:::demobucketedutestbitsade123" -> null
-       bucket                      = "demobucketedutestbitsade123" -> null
-       bucket_domain_name          = "demobucketedutestbitsade123.s3.amazonaws.com" -> null
-       bucket_regional_domain_name = "demobucketedutestbitsade123.s3.us-east-2.amazonaws.com" -> null
-       force_destroy               = false -> null
-       hosted_zone_id              = "Z2O1EMRO9K5GLX" -> null
-       id                          = "demobucketedutestbitsade123" -> null
-       object_lock_enabled         = false -> null
-       region                      = "us-east-2" -> null
-       request_payer               = "BucketOwner" -> null
-       tags                        = {} -> null
-       tags_all                    = {} -> null

-       grant {
-           id          = "4dca5c77b05a450651c2eaa2fdf853d11db764654b2ba182bbf78294ab55f641" -> null
-           permissions = [
-               "FULL_CONTROL",
            ] -> null
-           type        = "CanonicalUser" -> null
        }

-       versioning {
-           enabled    = false -> null
-           mfa_delete = false -> null
        }
    }
  # aws_s3_object.object has been deleted
-   resource "aws_s3_object" "object" {
-       acl                = "private" -> null
-       bucket             = "demobucketedutestbitsade123" -> null
-       bucket_key_enabled = false -> null
-       content_type       = "binary/octet-stream" -> null
-       etag               = "d41d8cd98f00b204e9800998ecf8427e" -> null
-       force_destroy      = false -> null
-       id                 = "demo/directory/folder1/folder2/" -> null
-       key                = "demo/directory/folder1/folder2/" -> null
-       metadata           = {} -> null
-       storage_class      = "STANDARD" -> null
-       tags               = {} -> null
-       tags_all           = {} -> null
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # aws_s3_bucket.this_bucket will be created
+   resource "aws_s3_bucket" "this_bucket" {
+       acceleration_status         = (known after apply)
+       acl                         = (known after apply)
+       arn                         = (known after apply)
+       bucket                      = "gitactionseduadevintatest1"
+       bucket_domain_name          = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       force_destroy               = false
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       object_lock_enabled         = (known after apply)
+       policy                      = (known after apply)
+       region                      = (known after apply)
+       request_payer               = (known after apply)
+       tags_all                    = (known after apply)
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)

+       cors_rule {
+           allowed_headers = (known after apply)
+           allowed_methods = (known after apply)
+           allowed_origins = (known after apply)
+           expose_headers  = (known after apply)
+           max_age_seconds = (known after apply)
        }

+       grant {
+           id          = (known after apply)
+           permissions = (known after apply)
+           type        = (known after apply)
+           uri         = (known after apply)
        }

+       lifecycle_rule {
+           abort_incomplete_multipart_upload_days = (known after apply)
+           enabled                                = (known after apply)
+           id                                     = (known after apply)
+           prefix                                 = (known after apply)
+           tags                                   = (known after apply)

+           expiration {
+               date                         = (known after apply)
+               days                         = (known after apply)
+               expired_object_delete_marker = (known after apply)
            }

+           noncurrent_version_expiration {
+               days = (known after apply)
            }

+           noncurrent_version_transition {
+               days          = (known after apply)
+               storage_class = (known after apply)
            }

+           transition {
+               date          = (known after apply)
+               days          = (known after apply)
+               storage_class = (known after apply)
            }
        }

+       logging {
+           target_bucket = (known after apply)
+           target_prefix = (known after apply)
        }

+       object_lock_configuration {
+           object_lock_enabled = (known after apply)

+           rule {
+               default_retention {
+                   days  = (known after apply)
+                   mode  = (known after apply)
+                   years = (known after apply)
                }
            }
        }

+       replication_configuration {
+           role = (known after apply)

+           rules {
+               delete_marker_replication_status = (known after apply)
+               id                               = (known after apply)
+               prefix                           = (known after apply)
+               priority                         = (known after apply)
+               status                           = (known after apply)

+               destination {
+                   account_id         = (known after apply)
+                   bucket             = (known after apply)
+                   replica_kms_key_id = (known after apply)
+                   storage_class      = (known after apply)

+                   access_control_translation {
+                       owner = (known after apply)
                    }

+                   metrics {
+                       minutes = (known after apply)
+                       status  = (known after apply)
                    }

+                   replication_time {
+                       minutes = (known after apply)
+                       status  = (known after apply)
                    }
                }

+               filter {
+                   prefix = (known after apply)
+                   tags   = (known after apply)
                }

+               source_selection_criteria {
+                   sse_kms_encrypted_objects {
+                       enabled = (known after apply)
                    }
                }
            }
        }

+       server_side_encryption_configuration {
+           rule {
+               bucket_key_enabled = (known after apply)

+               apply_server_side_encryption_by_default {
+                   kms_master_key_id = (known after apply)
+                   sse_algorithm     = (known after apply)
                }
            }
        }

+       versioning {
+           enabled    = (known after apply)
+           mfa_delete = (known after apply)
        }

+       website {
+           error_document           = (known after apply)
+           index_document           = (known after apply)
+           redirect_all_requests_to = (known after apply)
+           routing_rules            = (known after apply)
        }
    }

  # aws_s3_object.object will be created
+   resource "aws_s3_object" "object" {
+       acl                    = "private"
+       bucket                 = (known after apply)
+       bucket_key_enabled     = (known after apply)
+       content_type           = (known after apply)
+       etag                   = (known after apply)
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "demo/directory/folder1/folder2/"
+       kms_key_id             = (known after apply)
+       server_side_encryption = (known after apply)
+       storage_class          = (known after apply)
+       tags_all               = (known after apply)
+       version_id             = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```